app/views/pages/home.html.erb

SELECT "news".* FROM "news" WHERE "news"."title" = 'Вселенная вращается' LIMIT 1
---
<% @name = item.title %>
<% if News.find_by_title(@name) == nil %>

INSERT INTO "news" ("title", "link", "description", "created_at", "updated_at") VALUES ('Вселенная вращается', 'http://world-pulse.ru/archives/288', 'Интересные, весьма специфические исследования показали, что наша видимая Вселенная вращается вокруг определенной оси. Согласно официальной теории большого взрыва, наша Вселенная должна иметь более или менее однородное распределение вещества в пространстве. Однако, есть основания полагать, что это совершенно не так. Группа американских астрономов, которые наблюдали за направлением вращения более чем пятнадцати тысяч галактик, сделала вывод, что [...]', '2011-07-13 11:21:30.528901', '2011-07-13 11:21:30.528901')
---
<% newss[@name][:description] = item.description %>
<% newss[@name].save %>

SELECT "news".* FROM "news" WHERE "news"."id" = 1 LIMIT 1
---

<% novost = News.find(:all) -%>